In [1]:
import pandas as pd
from camelot import read_pdf

In [2]:
in_pdf=read_pdf("resources\PDF\cs-marklist.pdf",flavor='lattice',pages='1,2,3')

In [3]:
page=[]
for n in in_pdf:
    y=n.df
    y.drop([0],inplace=True)
    page.append(y)
    
df2=pd.concat(page,ignore_index=True)

In [4]:
df3=df2.copy()

In [5]:
df3.columns=["Score","Name","Stream"]

In [6]:
df3.shape

(115, 3)

In [7]:
df3.head()

           Score                     Name    Stream
0                     17 / 25 Rifa ayesha   SCIENCE
1                         21 / 25 Preethi   SCIENCE
2                   11 / 25 Smaran shetty  COMMERCE
3                 20 / 25 Ashish v shetty   SCIENCE
4  24 / 25 Vinit                            SCIENCE

In [8]:
df1=df3.copy()

In [9]:
df1["Stream"][df1.Stream==""]=df1.Name
df1.loc[df1["Score"]=='',"Score"]=df1.Name
df1["Name"][df1.Name==""]=df1.Score

In [10]:
df1.head()

                     Score                     Name    Stream
0      17 / 25 Rifa ayesha      17 / 25 Rifa ayesha   SCIENCE
1          21 / 25 Preethi          21 / 25 Preethi   SCIENCE
2    11 / 25 Smaran shetty    11 / 25 Smaran shetty  COMMERCE
3  20 / 25 Ashish v shetty  20 / 25 Ashish v shetty   SCIENCE
4            24 / 25 Vinit            24 / 25 Vinit   SCIENCE

In [11]:
df1.replace({
    "Name":['[0-9/]','SCIENCE','COMMERCE'],
    "Score":['/ 25','[A-Za-z..]'],
    "Stream":["[^'SCIENCE','COMMERCE']"]
},'',regex=True,inplace=True)

df1.Stream=df1["Stream"].replace(r'[A-Z]+SCIENCE',"SCIENCE",regex=True)
df1.Stream=df1["Stream"].replace(r'[A-Z]+COMMERCE',"COMMERCE",regex=True)

In [12]:
df1.head()

    Score                Name    Stream
0   17            Rifa ayesha   SCIENCE
1    21               Preethi   SCIENCE
2   11          Smaran shetty  COMMERCE
3  20         Ashish v shetty   SCIENCE
4    24                 Vinit   SCIENCE

In [13]:
df1.Name=df1.Name.str.lower()

In [14]:
df1.Score=df1.Score.apply(pd.to_numeric)

In [15]:
df1.Score.dtype

dtype('int64')

In [16]:
df1.head()

   Score                Name    Stream
0     17         rifa ayesha   SCIENCE
1     21             preethi   SCIENCE
2     11       smaran shetty  COMMERCE
3     20     ashish v shetty   SCIENCE
4     24               vinit   SCIENCE

In [17]:
df1.loc[df1.Score==25]

    Score                 Name    Stream
9      25               sumith   SCIENCE
13     25             thrupthi  COMMERCE
67     25     thrisha.u.shetty   SCIENCE